var names = prompt('как тебя зовут, лохматая?', '');

alert('тебя зовут ' + names + ' ахахахахах, ебать ты жертва аборта, я в шоках');

var surname = prompt('а фамилия то есть вообще? лохматая ' + names + ' ?', '');

alert('мм, ' + surname + ' пхах, капец');

var years = prompt('а годиков сколько тебе ' + names + ' ' + surname + ' ?', '');

alert('omg, ' + surname + ' ' + names + ' давай, одевай подгузник и спать ложись, малолетняя тварина)))');


var mom = confirm("мать жива?");
if (mom == true) {
	alert('пиздабол');
} else {
	alert('неужели сдохла, ой-ой-ой, жаль конеш');
}
